---
kind: method
id: M:Autodesk.Revit.DB.DividedPath.Flip
source: html/745dae0f-0ae7-e751-48f2-11a22b963d93.htm
---
# Autodesk.Revit.DB.DividedPath.Flip Method

Toggle the flipped value

## Syntax (C#)
```csharp
public void Flip()
```